Autodesk.Revit.DB.AreaTagTypeSet
A set that contains areatag types.

Autodesk.Revit.DB.AreaTagTypeSet.Insert(Autodesk.Revit.DB.AreaTagType)
System.Int32
Insert the specified areatag type into the set.
item: The areatag type to be inserted into the set.
Returns: Returns whether the areatag type was inserted into the set.

Autodesk.Revit.DB.AreaTagTypeSet.GetEnumerator
System.Collections.IEnumerator
Retrieve a forward moving iterator to the set.
Returns: Returns a forward moving iterator to the set.

Autodesk.Revit.DB.AreaTagTypeSet.ReverseIterator
Autodesk.Revit.DB.AreaTagTypeSetIterator
Retrieve a backward moving iterator to the set.
Returns: Returns a backward moving iterator to the set.

Autodesk.Revit.DB.AreaTagTypeSet.ForwardIterator
Autodesk.Revit.DB.AreaTagTypeSetIterator
Retrieve a forward moving iterator to the set.
Returns: Returns a forward moving iterator to the set.

Autodesk.Revit.DB.AreaTagTypeSet.Erase(Autodesk.Revit.DB.AreaTagType)
System.Int32
Removes a specified areatag type from the set.
item: The areatag type to be erased.
Returns: The number of areatag types that were erased from the set.

Autodesk.Revit.DB.AreaTagTypeSet.Contains(Autodesk.Revit.DB.AreaTagType)
System.Boolean
Tests for the existence of a areatag type within the set.
item: The areatag type to be searched for.
Returns: The Contains method returns True if the areatag type is within the set, otherwise False.

Autodesk.Revit.DB.AreaTagTypeSet.Clear
void
Removes every areatag type from the set, rendering it empty.

Autodesk.Revit.DB.AreaTagTypeSet.Size
System.Int32
get
Returns the number of areatag types that are in the set.

Autodesk.Revit.DB.AreaTagTypeSet.IsEmpty
System.Boolean
get
Test to see if the set is empty.
Remarks: If the set is empty then True will be returned, otherwise False.